trezor/trezor-firmware/core/embed/io/ble/stm32/ble.c
      drv->pairing_requested = false;
      if (drv->mode_current == BLE_MODE_PAIRING) {
        drv->pairing_allowed = true;
      } else {
        drv->pairing_allowed = false;
      }

      if (drv->mode_current != BLE_MODE_PAIRING) {
#ifdef BLE_MULTIPOINT
        if (msg.peer_count > 1) {
          drv->mode_requested = BLE_MODE_CONNECTABLE;
        } else {
          drv->mode_requested = BLE_MODE_KEEP_CONNECTION;
        }
#else
        drv->mode_requested = BLE_MODE_KEEP_CONNECTION;
#endif
      }
    } else {
      // connection lost
      ble_event_t event = {.type = BLE_DISCONNECTED};
      tsqueue_enqueue(&drv->event_queue, (uint8_t *)&event, sizeof(event),
                      NULL);

      if (drv->mode_requested == BLE_MODE_PAIRING) {
        ble_pairing_end(drv);
      }

      drv->pairing_allowed = false;
      drv->pairing_requested = false;
      if (msg.peer_count > 0) {
        drv->mode_requested = BLE_MODE_CONNECTABLE;
      } else {
        drv->mode_requested = BLE_MODE_OFF;
      }
    }

    memcpy(drv->connected_addr.addr, msg.connected_addr,
           sizeof(drv->connected_addr.addr));
    drv->connected_addr.type = msg.connected_addr_type;
    drv->connected = msg.connected;
  } else {
    if (memcmp(drv->connected_addr.addr, msg.connected_addr,
               sizeof(drv->connected_addr.addr)) != 0 ||
        drv->connected_addr.type != msg.connected_addr_type) {
      // address changed
      memcpy(drv->connected_addr.addr, msg.connected_addr,
             sizeof(drv->connected_addr.addr));
      drv->connected_addr.type = msg.connected_addr_type;

      ble_event_t event = {.type = BLE_CONNECTION_CHANGED};
      memcpy(event.data, drv->connected_addr.addr,
             sizeof(drv->connected_addr.addr));
      tsqueue_enqueue(&drv->event_queue, (uint8_t *)&event, sizeof(event),
                      NULL);
    }
  }

  ble_mode_t prev_mode = drv->mode_current;
  if ((msg.advertising && !msg.advertising_whitelist) ||
      (msg.connected && drv->pairing_allowed && !msg.flags.bonded_connection)) {
    drv->mode_current = BLE_MODE_PAIRING;
  } else if (msg.advertising) {
    drv->mode_current = BLE_MODE_CONNECTABLE;
  } else if (msg.connected) {
    drv->mode_current = BLE_MODE_KEEP_CONNECTION;
  } else {
    drv->mode_current = BLE_MODE_OFF;
  }

#ifdef BLE_MULTIPOINT
  if (drv->mode_current == BLE_MODE_KEEP_CONNECTION && drv->peer_count > 1) {
    drv->mode_requested = BLE_MODE_CONNECTABLE;
  }
#endif

  drv->busy_flag = msg.busy_flag;
  drv->peer_count = msg.peer_count;

  if (msg.connected && msg.flags.bonded_connection &&
      drv->mode_requested == BLE_MODE_PAIRING) {
    // bonded device connected in pairing mode - end pairing
    ble_pairing_end(drv);
  }

  if (prev_mode == BLE_MODE_PAIRING && drv->mode_current != BLE_MODE_PAIRING) {
    if (drv->mode_requested == BLE_MODE_PAIRING) {
      // unexpected pairing end - restart pairing
      ble_send_advertising_on(drv, false);
    } else {
      ble_pairing_end(drv);
    }
  }

  if (drv->mode_requested == BLE_MODE_KEEP_CONNECTION && !drv->connected) {
    if (drv->peer_count > 0 && drv->restart_adv_on_disconnect) {
      drv->mode_requested = BLE_MODE_CONNECTABLE;
    } else {
      drv->mode_requested = BLE_MODE_OFF;
    }
  }

  if (drv->mode_requested == BLE_MODE_CONNECTABLE &&
      !drv->restart_adv_on_disconnect) {
    if (drv->connected) {
      drv->mode_requested = BLE_MODE_KEEP_CONNECTION;
    } else {
      drv->mode_requested = BLE_MODE_OFF;
    }
  }

  // if there are no peers (i.e. after wiping the bonds), it makes no sense to
  // stay in connectable mode as there is no one that can connect
  if (msg.peer_count == 0 && drv->mode_requested == BLE_MODE_CONNECTABLE) {
    drv->mode_requested = BLE_MODE_OFF;
  }

  // in case connection speed differs from request, send a command
  if (msg.flags.high_speed != drv->high_speed) {
    ble_send_speed_request(drv, drv->high_speed);
  }

  drv->status_valid = true;
}

static void ble_process_rx_msg_pairing_request(const uint8_t *data,
                                               uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  if (len < 7) {
    // insufficient data length
    return;
  }

  if (drv->pairing_allowed == false) {
    ble_send_pairing_reject(drv);
    return;
  }

  ble_event_t event = {.type = BLE_PAIRING_REQUEST,
                       .data_len = BLE_PAIRING_CODE_LEN};
  memcpy(event.data, &data[1], BLE_PAIRING_CODE_LEN);
  if (!tsqueue_enqueue(&drv->event_queue, (uint8_t *)&event, sizeof(event),
                       NULL)) {
    ble_send_pairing_reject(drv);
  } else {
    drv->pairing_requested = true;
  }
}

static void ble_process_rx_msg_pairing_cancelled(const uint8_t *data,
                                                 uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  ble_event_t event = {.type = BLE_PAIRING_CANCELLED, .data_len = 0};
  tsqueue_enqueue(&drv->event_queue, (uint8_t *)&event, sizeof(event), NULL);
  ble_pairing_end(drv);
}

static void ble_process_rx_msg_pairing_completed(const uint8_t *data,
                                                 uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  ble_event_t event = {.type = BLE_PAIRING_COMPLETED, .data_len = 0};
  tsqueue_enqueue(&drv->event_queue, (uint8_t *)&event, sizeof(event), NULL);
  drv->pairing_allowed = false;
  drv->pairing_requested = false;
}

static void ble_process_rx_msg_mac(const uint8_t *data, uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  drv->mac_ready = true;
  drv->mac.type = 0;
  memcpy(&drv->mac.addr, &data[1], sizeof(drv->mac.addr));
}

static void ble_process_rx_msg_bond_list(const uint8_t *data, uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  if (len < 2) {
    return;
  }

  drv->bonds_ready = true;
  drv->bond_count = data[1];
  memcpy(&drv->bonds, &data[2], MIN(len - 2, sizeof(drv->bonds)));
}

static void ble_process_rx_msg(const uint8_t *data, uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;

