trezor/trezor-firmware/core/embed/io/ble/stm32/ble.c
  if (len < 1) {
    return;
  }

  switch (data[0]) {
    case INTERNAL_EVENT_STATUS:
      ble_process_rx_msg_status(data, len);
      break;
    case INTERNAL_EVENT_PAIRING_REQUEST:
      ble_process_rx_msg_pairing_request(data, len);
      break;
    case INTERNAL_EVENT_PAIRING_CANCELLED:
      ble_process_rx_msg_pairing_cancelled(data, len);
      break;
    case INTERNAL_EVENT_MAC:
      ble_process_rx_msg_mac(data, len);
      break;
    case INTERNAL_EVENT_PAIRING_COMPLETED:
      ble_process_rx_msg_pairing_completed(data, len);
      break;
    case INTERNAL_EVENT_BOND_LIST:
      ble_process_rx_msg_bond_list(data, len);
      break;
    case INTERNAL_EVENT_SUCCESS:
      drv->result_ready = true;
      drv->result = true;
      break;
    case INTERNAL_EVENT_FAILURE:
      drv->result_ready = true;
      drv->result = false;
      break;
    default:
      break;
  }
}

static bool ble_connected_add_match(ble_driver_t *drv, const uint8_t *addr) {
  return (addr[0] == drv->connected_addr.type &&
          memcmp(&addr[1], drv->connected_addr.addr,
                 sizeof(drv->connected_addr.addr)) == 0);
}

static void ble_process_data(const uint8_t *data, uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return;
  }

  if (!drv->accept_msgs) {
    return;
  }

  if (len != BLE_DATA_SIZE) {
    return;
  }

  if (!ble_connected_add_match(drv, data)) {
    // inconsistent address of a connected device

    drv->connected_addr.type = data[0];
    memcpy(drv->connected_addr.addr, &data[1],
           sizeof(drv->connected_addr.addr));

    ble_event_t event = {.type = BLE_CONNECTION_CHANGED};
    memcpy(event.data, drv->connected_addr.addr,
           sizeof(drv->connected_addr.addr));
    tsqueue_enqueue(&drv->event_queue, (uint8_t *)&event, sizeof(event), NULL);
  }

  tsqueue_enqueue(&drv->rx_queue, data, len, NULL);
}

// background loop, called from systimer every LOOP_PERIOD_MS
static void ble_loop(void *context) {
  ble_driver_t *drv = (ble_driver_t *)context;

  if (!drv->initialized) {
    return;
  }

  if (nrf_is_running()) {
    if (drv->ping_cntr == 0) {
      ble_send_state_request(drv);
    }

    drv->ping_cntr++;
    if (drv->ping_cntr >= PING_PERIOD / LOOP_PERIOD_MS) {
      drv->ping_cntr = 0;
    }

    uint8_t data[BLE_DATA_SIZE] = {0};
    if (tsqueue_dequeue(&drv->tx_queue, data, BLE_DATA_SIZE, NULL, NULL)) {
      if (!nrf_send_msg(NRF_SERVICE_BLE, data, BLE_DATA_SIZE, NULL, NULL)) {
        tsqueue_enqueue(&drv->tx_queue, data, BLE_DATA_SIZE, NULL);
      }
    }

    if (drv->accept_msgs && drv->busy_flag != 0) {
      cmd_set_busy_t cmd = {
          .cmd_id = INTERNAL_CMD_SET_BUSY,
          .flag = 0,
      };
      nrf_send_msg(NRF_SERVICE_BLE_MANAGER, (uint8_t *)&cmd, sizeof(cmd), NULL,
                   NULL);
    }

    if (!drv->accept_msgs && drv->busy_flag == 0) {
      cmd_set_busy_t cmd = {
          .cmd_id = INTERNAL_CMD_SET_BUSY,
          .flag = 1,
      };
      nrf_send_msg(NRF_SERVICE_BLE_MANAGER, (uint8_t *)&cmd, sizeof(cmd), NULL,
                   NULL);
    }

    if (drv->mode_current != drv->mode_requested) {
      if (drv->mode_requested == BLE_MODE_OFF) {
        ble_send_advertising_off(drv);
        if (drv->connected) {
          ble_send_disconnect(drv);
        }
      } else if (drv->mode_requested == BLE_MODE_KEEP_CONNECTION) {
        ble_send_advertising_off(drv);
      } else if (drv->mode_requested == BLE_MODE_CONNECTABLE) {
        ble_send_advertising_on(drv, true);
      } else if (drv->mode_requested == BLE_MODE_PAIRING) {
        ble_send_advertising_on(drv, false);
      }
    }
  } else {
    drv->status_valid = false;
  }
}

bool ble_init(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (drv->initialized) {
    return true;
  }

  memset(drv, 0, sizeof(ble_driver_t));

  tsqueue_init(&drv->event_queue, drv->event_queue_entries,
               (uint8_t *)drv->event_queue_buffers, sizeof(ble_event_t),
               EVENT_QUEUE_LEN);

  tsqueue_init(&drv->rx_queue, drv->rx_queue_entries,
               (uint8_t *)drv->rx_queue_buffers, BLE_DATA_SIZE, RX_QUEUE_LEN);

  tsqueue_init(&drv->tx_queue, drv->ts_queue_entries,
               (uint8_t *)drv->tx_queue_buffers, BLE_DATA_SIZE, TX_QUEUE_LEN);

  drv->timer = systimer_create(ble_loop, drv);

  if (drv->timer == NULL) {
    goto cleanup;
  }

  systimer_set_periodic(drv->timer, LOOP_PERIOD_MS);

  nrf_init();
  if (!nrf_register_listener(NRF_SERVICE_BLE_MANAGER, ble_process_rx_msg)) {
    goto cleanup;
  }
  if (!nrf_register_listener(NRF_SERVICE_BLE, ble_process_data)) {
    goto cleanup;
  }

  if (!syshandle_register(SYSHANDLE_BLE, &ble_handle_vmt, drv)) {
    goto cleanup;
  }

  if (!syshandle_register(SYSHANDLE_BLE_IFACE_0, &ble_iface_handle_vmt, drv)) {
    goto cleanup;
  }

  drv->initialized = true;
  return true;

cleanup:
  if (drv->timer != NULL) {
    systimer_delete(drv->timer);
  }
  nrf_deinit();
  memset(drv, 0, sizeof(ble_driver_t));
  return false;
}

static void ble_deinit_common(ble_driver_t *drv) {
  if (!drv->initialized) {
    return;
  }

  syshandle_unregister(SYSHANDLE_BLE_IFACE_0);
  syshandle_unregister(SYSHANDLE_BLE);

  nrf_unregister_listener(NRF_SERVICE_BLE);
  nrf_unregister_listener(NRF_SERVICE_BLE_MANAGER);

  systimer_delete(drv->timer);

  tsqueue_reset(&drv->event_queue);
  tsqueue_reset(&drv->rx_queue);
  tsqueue_reset(&drv->tx_queue);
}

void ble_deinit(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (drv->initialized) {
    ble_deinit_common(drv);
    nrf_deinit();
    drv->initialized = false;
  }
}

void ble_suspend(ble_wakeup_params_t *wakeup_params) {
  ble_driver_t *drv = &g_ble_driver;

  memset(wakeup_params, 0, sizeof(ble_wakeup_params_t));

  if (drv->initialized) {
    bool connected = drv->connected;
    wakeup_params->accept_msgs = drv->accept_msgs;
    wakeup_params->mode_requested = drv->mode_requested;
    wakeup_params->peer_count = drv->peer_count;
    wakeup_params->high_speed = drv->high_speed;
    memcpy(&wakeup_params->adv_data, &drv->adv_cmd, sizeof(drv->adv_cmd));

    ble_deinit_common(drv);

    if (!connected) {
      wakeup_params->reboot_on_resume = true;
      // if not connected, we can turn off the radio
      nrf_system_off();
      nrf_deinit();
    } else {
      irq_key_t key = irq_lock();
      memcpy(&wakeup_params->connected_addr, &drv->connected_addr,
             sizeof(drv->connected_addr));
      irq_unlock(key);
      nrf_suspend();
    }

    drv->initialized = false;
  }
}

bool ble_resume(const ble_wakeup_params_t *wakeup_params) {
  ble_driver_t *drv = &g_ble_driver;

