trezor/trezor-firmware/core/embed/io/ble/stm32/ble.c
  if (!ble_init()) {
    return false;
  }

  if (wakeup_params->reboot_on_resume) {
    nrf_reboot();
  } else {
    nrf_resume();
  }

  irq_key_t key = irq_lock();

  drv->peer_count = wakeup_params->peer_count;
  drv->high_speed = wakeup_params->high_speed;

  memcpy(&drv->connected_addr, &wakeup_params->connected_addr,
         sizeof(drv->connected_addr));
  memcpy(&drv->adv_cmd, &wakeup_params->adv_data, sizeof(drv->adv_cmd));
  drv->mode_requested = wakeup_params->mode_requested;

  irq_unlock(key);

  if (wakeup_params->accept_msgs) {
    ble_start();
  }

  return true;
}

bool ble_connected(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  bool connected = drv->connected && nrf_is_running();

  irq_unlock(key);

  return connected;
}

void ble_start(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return;
  }

  irq_key_t key = irq_lock();

  drv->accept_msgs = true;

  irq_unlock(key);
}

void ble_stop(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return;
  }

  irq_key_t key = irq_lock();

  drv->accept_msgs = false;
  tsqueue_reset(&drv->rx_queue);

  irq_unlock(key);
}

bool ble_can_write(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  if (!drv->connected || !drv->accept_msgs) {
    irq_unlock(key);
    return false;
  }

  bool full = !tsqueue_full(&drv->tx_queue);

  irq_unlock(key);

  return full;
}

bool ble_write(const uint8_t *data, uint16_t len) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  if (!drv->connected || !drv->accept_msgs) {
    irq_unlock(key);
    return false;
  }

  uint8_t tx_buf[BLE_DATA_SIZE];
  tx_buf[0] = drv->connected_addr.type;
  memcpy(&tx_buf[1], drv->connected_addr.addr,
         sizeof(drv->connected_addr.addr));
  memcpy(&tx_buf[BLE_DATA_HEADER_SIZE], data,
         MIN(len, BLE_DATA_SIZE - BLE_DATA_HEADER_SIZE));

  bool sent = nrf_send_msg(NRF_SERVICE_BLE, tx_buf, len + BLE_DATA_HEADER_SIZE,
                           NULL, NULL);

  if (!sent) {
    bool queued = tsqueue_enqueue(&drv->tx_queue, tx_buf,
                                  len + BLE_DATA_HEADER_SIZE, NULL);
    irq_unlock(key);
    return queued;
  }

  irq_unlock(key);
  return true;
}

bool ble_can_read(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  bool result = !tsqueue_empty(&drv->rx_queue);

  irq_unlock(key);

  return result;
}

uint32_t ble_read(uint8_t *data, uint16_t max_len) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return 0;
  }

  irq_key_t key = irq_lock();

  tsqueue_t *queue = &drv->rx_queue;

  uint16_t read_len = 0;

  uint8_t rx_data[BLE_DATA_SIZE];

  tsqueue_dequeue(queue, rx_data, sizeof(rx_data), &read_len, NULL);

  if (read_len != BLE_DATA_SIZE ||
      max_len < (read_len - BLE_DATA_HEADER_SIZE)) {
    irq_unlock(key);
    return 0;
  }

  // first 7 bytes is MAC, ignore for now
  memcpy(data, &rx_data[BLE_DATA_HEADER_SIZE], BLE_RX_PACKET_SIZE);

  irq_unlock(key);

  return BLE_RX_PACKET_SIZE;
}

bool ble_issue_command(ble_command_t *command) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  bool result = false;

  switch (command->cmd_type) {
    case BLE_SWITCH_OFF:
      drv->restart_adv_on_disconnect = false;
      drv->mode_requested = BLE_MODE_OFF;
      result = true;
      break;
    case BLE_SWITCH_ON:
      drv->restart_adv_on_disconnect = true;
      memcpy(&drv->adv_cmd, &command->data.adv_start, sizeof(drv->adv_cmd));
      if (drv->connected) {
        drv->mode_requested = BLE_MODE_KEEP_CONNECTION;
      } else {
        drv->mode_requested = BLE_MODE_CONNECTABLE;
      }
      result = true;
      break;
    case BLE_PAIRING_MODE:
      drv->restart_adv_on_disconnect = true;
      irq_unlock(key);
      result = ble_start_pairing(command);
      return result;
    case BLE_DISCONNECT:
      if (drv->connected && drv->restart_adv_on_disconnect) {
        drv->next_adv_with_disconnect = true;
      }
      result = ble_send_disconnect(drv);
      break;
    case BLE_ERASE_BONDS:
      result = ble_send_erase_bonds(drv);
      break;
    case BLE_ALLOW_PAIRING:
      result = ble_send_pairing_accept(drv, command->data.pairing_code);
      break;
    case BLE_REJECT_PAIRING:
      result = ble_send_pairing_reject(drv);
      break;
    case BLE_KEEP_CONNECTION:
      drv->restart_adv_on_disconnect = false;
      if (drv->connected) {
        drv->mode_requested = BLE_MODE_KEEP_CONNECTION;
      } else {
        drv->mode_requested = BLE_MODE_OFF;
      }
      break;
    default:
      break;
  }

  irq_unlock(key);

  return result;
}

bool ble_get_event(ble_event_t *event) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  bool result = tsqueue_dequeue(&drv->event_queue, (uint8_t *)event,
                                sizeof(*event), NULL, NULL);

  irq_unlock(key);

  return result;
}

static void ble_event_flush(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return;
  }

  irq_key_t key = irq_lock();

  tsqueue_reset(&drv->event_queue);

  irq_unlock(key);
}

void ble_set_name(const uint8_t *name, size_t len) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return;
  }

  irq_key_t key = irq_lock();

  memset(drv->adv_cmd.name, 0, sizeof(drv->adv_cmd.name));
  memcpy(drv->adv_cmd.name, name, MIN(len, sizeof(drv->adv_cmd.name)));

  if (drv->mode_requested == BLE_MODE_CONNECTABLE) {
    ble_send_advertising_on(drv, true);
  }

  if (drv->mode_requested == BLE_MODE_PAIRING) {
    ble_send_advertising_on(drv, false);
  }

  irq_unlock(key);
}

static bool ble_start_pairing(ble_command_t *command) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  uint16_t retry_cnt = 0;
  irq_key_t key;

