trezor/trezor-firmware/core/embed/io/ble/stm32/ble.c
  bool connected = drv->connected;
  while (connected) {
    retry_cnt++;
    if (retry_cnt > 10) {
      // too many retries, give up
      return false;
    }

    ble_send_disconnect(drv);

    systick_delay_ms(20);  // wait for disconnect to complete

    key = irq_lock();
    connected = drv->connected;
    irq_unlock(key);
  }

  ble_event_flush();

  key = irq_lock();

  memcpy(&drv->adv_cmd, &command->data.adv_start, sizeof(drv->adv_cmd));
  drv->mode_requested = BLE_MODE_PAIRING;

  irq_unlock(key);

  return true;
}

void ble_get_state(ble_state_t *state) {
  const ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    memset(state, 0, sizeof(ble_state_t));
    return;
  }

  irq_key_t key = irq_lock();

  state->connected = drv->connected;
  state->peer_count = drv->peer_count;
  state->pairing = drv->mode_current == BLE_MODE_PAIRING;
  state->connectable = drv->mode_current == BLE_MODE_CONNECTABLE;
  state->pairing_requested = drv->pairing_requested;
  state->state_known = drv->status_valid;
  memcpy(&state->connected_addr, &drv->connected_addr,
         sizeof(drv->connected_addr));

  irq_unlock(key);
}

bool ble_get_mac(bt_le_addr_t *mac) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    memset(mac, 0, sizeof(*mac));
    return false;
  }

  drv->mac_ready = false;

  if (!ble_send_mac_request(drv)) {
    return false;
  }

  uint32_t timeout = ticks_timeout(100);

  while (!ticks_expired(timeout)) {
    irq_key_t key = irq_lock();
    if (drv->mac_ready) {
      memcpy(mac, &drv->mac, sizeof(drv->mac));
      irq_unlock(key);
      return true;
    }
    irq_unlock(key);
  }

  memset(mac, 0, sizeof(*mac));
  return false;
}

uint8_t ble_get_bond_list(bt_le_addr_t *bonds, size_t count) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized || count < BLE_MAX_BONDS) {
    memset(bonds, 0, count * sizeof(bt_le_addr_t));
    return 0;
  }

  drv->bonds_ready = false;

  if (!ble_send_bond_list_request(drv)) {
    return 0;
  }

  uint32_t timeout = ticks_timeout(100);

  while (!ticks_expired(timeout)) {
    irq_key_t key = irq_lock();
    if (drv->bonds_ready) {
      memcpy(bonds, &drv->bonds, sizeof(drv->bonds));
      irq_unlock(key);
      return drv->bond_count;
    }
    irq_unlock(key);
  }

  memset(bonds, 0, count * sizeof(bt_le_addr_t));
  return 0;
}

void ble_get_advertising_name(char *name, size_t max_len) {
  ble_driver_t *drv = &g_ble_driver;

  if (max_len < sizeof(drv->adv_cmd.name)) {
    memset(name, 0, max_len);
    return;
  }

  if (!drv->initialized) {
    memset(name, 0, max_len);
    return;
  }

  memcpy(name, drv->adv_cmd.name, sizeof(drv->adv_cmd.name));
}

bool ble_unpair(const bt_le_addr_t *addr) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();
  drv->result_ready = false;
  irq_unlock(key);

  bool result;
  if (addr == NULL) {
    uint8_t cmd = INTERNAL_CMD_UNPAIR;
    result = nrf_send_msg(NRF_SERVICE_BLE_MANAGER, &cmd, sizeof(cmd), NULL,
                          NULL) >= 0;
  } else {
    uint8_t data[1 + sizeof(bt_le_addr_t)] = {0};
    data[0] = INTERNAL_CMD_UNPAIR;
    memcpy(&data[1], addr, sizeof(bt_le_addr_t));
    result = nrf_send_msg(NRF_SERVICE_BLE_MANAGER, data, sizeof(data), NULL,
                          NULL) >= 0;
  }

  if (!result) {
    return false;
  }

  result = false;

  uint32_t timeout = ticks_timeout(100);
  while (!ticks_expired(timeout)) {
    key = irq_lock();
    if (drv->result_ready) {
      result = drv->result;
      irq_unlock(key);
      return result;
    }
    irq_unlock(key);
  }

  return result;
}

void ble_set_high_speed(bool enable) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  irq_key_t key = irq_lock();
  drv->high_speed = enable;
  irq_unlock(key);
}

static void on_ble_iface_event_poll(void *context, bool read_awaited,
                                    bool write_awaited) {
  UNUSED(context);

  syshandle_t handle = SYSHANDLE_BLE_IFACE_0;

  // Only one task can read or write at a time. Therefore, we can
  // assume that only one task is waiting for events and keep the
  // logic simple.

  if (read_awaited && ble_can_read()) {
    syshandle_signal_read_ready(handle, NULL);
  }

  if (write_awaited && ble_can_write()) {
    syshandle_signal_write_ready(handle, NULL);
  }
}

static bool on_ble_iface_read_ready(void *context, systask_id_t task_id,
                                    void *param) {
  UNUSED(context);
  UNUSED(task_id);
  UNUSED(param);

  return ble_can_read();
}

static bool on_ble_iface_check_write_ready(void *context, systask_id_t task_id,
                                           void *param) {
  UNUSED(context);
  UNUSED(task_id);
  UNUSED(param);

  return ble_can_write();
}

static const syshandle_vmt_t ble_iface_handle_vmt = {
    .task_created = NULL,
    .task_killed = NULL,
    .check_read_ready = on_ble_iface_read_ready,
    .check_write_ready = on_ble_iface_check_write_ready,
    .poll = on_ble_iface_event_poll,
};

static void on_ble_poll(void *context, bool read_awaited, bool write_awaited) {
  ble_driver_t *drv = (ble_driver_t *)context;

  UNUSED(write_awaited);

  // Until we need to poll BLE events from multiple tasks,
  // the logic here can remain very simple. If this assumption
  // changes, the logic will need to be updated (e.g., task-local storage
  // with an independent queue for each task).

  if (read_awaited) {
    irq_key_t key = irq_lock();
    bool queue_is_empty = tsqueue_empty(&drv->event_queue);
    irq_unlock(key);

    syshandle_signal_read_ready(SYSHANDLE_BLE, &queue_is_empty);
  }
}

static bool on_ble_check_read_ready(void *context, systask_id_t task_id,
                                    void *param) {
  UNUSED(context);
  UNUSED(task_id);

  bool queue_is_empty = *(bool *)param;

  return !queue_is_empty;
}

static const syshandle_vmt_t ble_handle_vmt = {
    .task_created = NULL,
    .task_killed = NULL,
    .check_read_ready = on_ble_check_read_ready,
    .check_write_ready = NULL,
    .poll = on_ble_poll,
};

#endif
